app/controllers/likes_controller.rb

INSERT INTO "likes" ("soundcard_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["soundcard_id", 1], ["user_id", 2], ["created_at", "2023-02-06 21:24:21.102023"], ["updated_at", "2023-02-06 21:24:21.102023"]]
---
   def create
    if already_liked?
        # @like.destroy
        render json: {message: "You can't like more than once"}
      else
        @soundcard.likes.create(user_id: current_user.id)

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 5]]
---
   def destroy
    if !(already_liked?)
        render json: {message: "You can't unlike more than once"}
    else
      @like.destroy

SELECT "likes".* FROM "likes" WHERE "likes"."soundcard_id" = ? AND "likes"."id" = ? LIMIT ?  [["soundcard_id", 2], ["id", 5], ["LIMIT", 1]]
---
   def find_like
    @like = @soundcard.likes.find(params[:id])

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."soundcard_id" = ? LIMIT ?  [["user_id", 1], ["soundcard_id", 2], ["LIMIT", 1]]
---
   def already_liked?
    Like.where(user_id: current_user.id, soundcard_id:
    params[:soundcard_id]).exists?

SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
   def find_soundcard
    @soundcard = Soundcard.find(params[:soundcard_id])