app/controllers/soundcards_controller.rb

  def create
    @soundcard = Soundcard.new(soundcard_params.except(:tags).merge(user_id: current_user.id))
    create_or_delete_soundcards_tags(@soundcard, params[:soundcard][:tags])
    if @soundcard.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tag1"], ["created_at", "2023-02-01 12:33:53.626616"], ["updated_at", "2023-02-01 12:33:53.626616"]]