app/controllers/soundcards_controller.rb

SELECT "soundcards".* FROM "soundcards"
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards" WHERE (name like '%Дождь%') AND (location like '%kj%')
SELECT "strikes".* FROM "strikes" WHERE "strikes"."soundcard_id" = ? LIMIT ?  [["soundcard_id", 1], ["LIMIT", 11]]
SELECT "soundcards".* FROM "soundcards" WHERE (name like '%Дождь%')
---
  def index
  @soundcards = Soundcard.all
  filtering_params(params).each do |key, value|
    @soundcards = @soundcards.public_send("filter_by_#{key}", value) if value.present?
  end
  @soundcards = @soundcards.select {|soundcard| soundcard.strikes.count <= 2}
  @soundcardstest = Kaminari.paginate_array(@soundcards).page(params[:page]).per(15)

   @soundcards = @soundcardstest.map do |soundcard|

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."soundcard_id" = ?  [["soundcard_id", 1]]
---
  def show
    @author = User.where(id: @soundcard.user_id)
    render json: {likes: @soundcard.likes, tags: @soundcard.tags, soundcard: @soundcard, author: @author.first.name, strikes: @soundcard.strikes}, status: :ok

INSERT INTO "tags" ("tagname", "created_at", "updated_at") VALUES (?, ?, ?)  [["tagname", "природа"], ["created_at", "2023-02-13 12:22:58.543749"], ["updated_at", "2023-02-13 12:22:58.543749"]]
INSERT INTO "soundcards" ("name", "description", "audiofile", "image", "location", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @soundcard = Soundcard.new(soundcard_params.except(:tags).merge(user_id: current_user.id))
    create_or_delete_soundcards_tags(@soundcard, params[:soundcard][:tags])
    if @soundcard.save

UPDATE "soundcards" SET "location" = ?, "updated_at" = ? WHERE "soundcards"."id" = ?  [["location", "Дождливая улица"], ["updated_at", "2023-02-13 11:24:54.230747"], ["id", 1]]
---
  def update
    create_or_delete_soundcards_tags(@soundcard, params[:soundcard][:tags])
    if @soundcard.update(soundcard_params.except(:tags))

DELETE FROM "soundcards" WHERE "soundcards"."id" = ?  [["id", 1]]
---
  def destroy
    @soundcard.destroy

SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards" WHERE (created_at >= '2023-02-06')
SELECT "soundcards".* FROM "soundcards"
---
  def newest
    @middleres = Soundcard.all.select{|soundcard| soundcard.strikes.count <= 2 && soundcard.created_at >= Date.today - 7}
    @current = Kaminari.paginate_array(@middleres).page(params[:page]).per(15)

SELECT COUNT(*) FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards"
SELECT "likes".* FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
---
  def popular
    @popular = Soundcard.all.select {|soundcard| soundcard.likes.count >= 1 && soundcard.strikes.count <= 2 }
    @current = Kaminari.paginate_array(@popular).page(params[:page]).per(15)
    @popular = @current.map do |soundcard|

SELECT COUNT(*) FROM "soundcards"
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards" ORDER BY "soundcards"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
SELECT "strikes".* FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 2]]
SELECT "soundcards".* FROM "soundcards"
---
  def newshort
    @middleres = Soundcard.all.select{|soundcard| soundcard.strikes.count <= 2 && soundcard.created_at >= Date.today - 7}
    @current_week = @middleres.map do |soundcard|

SELECT COUNT(*) FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards"
SELECT "likes".* FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
---
  def popshort
    @popular = Soundcard.all.select {|soundcard| soundcard.likes.count >= 1 && soundcard.strikes.count <= 2 }
    @popular = @popular.map do |soundcard|

SELECT COUNT(*) FROM "soundcards"
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards" ORDER BY "soundcards"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."soundcard_id" = ?  [["soundcard_id", 1]]
---
  def random
    @random_sound_count = Soundcard.all.select {|soundcard| soundcard.strikes.count <= 2}
    @random_sound = Soundcard.offset(rand(@random_sound_count.length)).first

    @author = User.where(id: @random_sound.user_id)
    render json: {likes: @random_sound.likes, tags: @random_sound.tags, soundcard: @random_sound, author: @author.first.name}, status: :ok

SELECT "soundcards".* FROM "soundcards"
SELECT "strikes".* FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 2]]
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
---
  def striked
    @striked = Soundcard.all.select {|soundcard| soundcard.strikes.count >= 1}

SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_soundcard
      @soundcard = Soundcard.find(params[:id])