app/controllers/strikes_controller.rb

    def index
        strikes = Strike.all
---
SELECT "strikes".* FROM "strikes"

   def create
    if already_striked?
        # @strike.destroy
        render json: {message: "You can't strike more than once"}
      else
        @soundcard.strikes.create(user_id: current_user.id)
---
INSERT INTO "strikes" ("soundcard_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["soundcard_id", 2], ["user_id", 1], ["created_at", "2023-02-24 16:34:05.378468"], ["updated_at", "2023-02-24 16:34:05.378468"]]

   def already_striked?
    Strike.where(user_id: current_user.id, soundcard_id:
    params[:soundcard_id]).exists?
---
SELECT 1 AS one FROM "strikes" WHERE "strikes"."user_id" = ? AND "strikes"."soundcard_id" = ? LIMIT ?  [["user_id", 1], ["soundcard_id", 2], ["LIMIT", 1]]

   def find_soundcard
    @soundcard = Soundcard.find(params[:soundcard_id])
---
SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]