app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
    filtering_params(params).each do |key, value|
      @tags = @tags.public_send("filter_by_#{key}", value) if value.present?
    end
    @tagsfin = Kaminari.paginate_array(@tags).page(params[:page]).per(15)
---
SELECT "tags".* FROM "tags" WHERE (name like '%бар%')
SELECT "tags".* FROM "tags"

  def show
    @tagged = @tag.taggables
    @tagged = @tagged.map do |soundcard|
      soundcard.as_json.merge({:soundcard => Soundcard.find_by(id: soundcard.soundcard_id), tags: Soundcard.find_by(id: soundcard.soundcard_id).tags })
---
SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."soundcard_id" = ?  [["soundcard_id", 3]]
SELECT "taggables".* FROM "taggables" WHERE "taggables"."tag_id" = ?  [["tag_id", 5]]
SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]