app/controllers/users_controller.rb

  def index
    @users = User.all
    filtering_params(params).each do |key, value|
      @users = @users.public_send("filter_by_#{key}", value) if value.present?
    end

    @usersfin = Kaminari.paginate_array(@users).page(params[:page]).per(15)
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (name like '%do%')

  def follow
    @user = User.find(params[:id])
    current_user.followees << @user
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followee_id", 2], ["created_at", "2023-01-30 21:21:07.331095"], ["updated_at", "2023-01-30 21:21:07.331095"]]

  def unfollow
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def liked
    @user = User.find(params[:id])
    if @user
      @liked = @user.liked_soundcards
      @liked = @liked.where("lower(location) like ? OR lower(name) like ?", "%#{params[:multiple]}%", "%#{params[:multiple]}%") if params[:multiple].present?

      @liked = @liked.order(created_at: :desc).select {|soundcard| soundcard.strikes.count <= 2}
      @liked = @liked.map do |soundcard|
        soundcard.as_json.merge({:likes => soundcard.likes, :tags => soundcard.tags})
    end
    @likedfin = Kaminari.paginate_array(@liked).page(params[:page]).per(15)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]

  def created
    @user = User.find(params[:id])
    if @user
      @soundcards = Soundcard.where(user_id: @user.id)
      @soundcards = @soundcards.where("lower(location) like ? OR lower(name) like ?", "%#{params[:multiple]}%", "%#{params[:multiple]}%") if params[:multiple].present?

      @soundcards = @soundcards.order(created_at: :desc).select {|soundcard| soundcard.strikes.count <= 2}

      @soundcards = @soundcards.map do |soundcard|
        soundcard.as_json.merge({:likes => soundcard.likes, :tags => soundcard.tags})
    end

      @soundcardsfin = Kaminari.paginate_array(@soundcards).page(params[:page]).per(15)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 1]]
SELECT "soundcards".* FROM "soundcards" WHERE "soundcards"."user_id" = ? AND (location like '%Дож%' OR name like '%Дож%')  [["user_id", 1]]

  def following
    @user = User.find(params[:id])
    if @user
      @follow = @user.followed_users
      @following = @user.followees.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def followed
    @user = User.find(params[:id])
    if @user
      @following = @user.followers.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def feed
    @user = User.find(params[:id])
    if @user

      @following = @user.followees.all.map do |followee|

        @soundcards = Soundcard.all.order(created_at: :desc).select {|soundcard| soundcard.user_id == followee.id && soundcard.created_at >= Date.today - 7 && soundcard.strikes.count <= 2}
        @soundcards = @soundcards.map do |soundcard|
          soundcard.as_json.merge({:likes => soundcard.likes, :tags => soundcard.tags})
      end

        followee.as_json.merge({:sounds => @soundcards.first(3), :count => @soundcards.count})
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "follows" ON "users"."id" = "follows"."follower_id" WHERE "follows"."followee_id" = ?  [["followee_id", 2]]
SELECT "soundcards".* FROM "soundcards"
SELECT COUNT(*) FROM "strikes" WHERE "strikes"."soundcard_id" = ?  [["soundcard_id", 2]]

  def update_info
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "name" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-06 20:37:43.697876"], ["name", "dorothieny"], ["id", 2]]