app/controllers/users_controller.rb

  def update_info
    @user = User.find(params[:id])

    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "name" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-13 09:54:46.965454"], ["name", "dorothieny"], ["id", 1]]